//去重加排序 这也鸭困难 无语hw
// 明明想在学校中请一些同学一起做一项问卷调查，为了实验的客观性，他先用计算机生成了 N 个 1 到 1000 之间的随机整数（ N≤1000 ），对于其中重复的数字，只保留一个，把其余相同的数去掉，不同的数对应着不同的学生的学号。然后再把这些数从小到大排序，按照排好的顺序去找同学做调查。现在明明把他已经用计算机生成好的 N 个随机数按照下面的输入描述的格式交给你，请你协助明明完成“去重”与“排序”的工作(同一个测试用例里可能会有多组数据(用于不同的调查)，希望大家能正确处理)。


// 注：测试用例保证输入参数的正确性，答题者无需验证。测试用例不止一组。

// 当没有新的输入时，说明输入结束。

// 数据范围： 1 \le n \le 1000 \1≤n≤1000  ，输入的数字大小满足 1 \le val \le 500 \1≤val≤500 
// 输入描述：
// 注意：输入可能有多组数据(用于不同的调查)。每组数据都包括多行，第一行先输入随机整数的个数 N ，接下来的 N 行再输入相应个数的整数。具体格式请看下面的"示例"。

// 输出描述：
// 返回多行，处理后的结果

let num
while (num = readline()) {
    let set = new Set()
    for (let i = 0; i < num; i++) {
        set.add(readline())
    }
    const arr = [...set].sort((a, b) => a - b)
    arr.forEach((i) => {
        console.log(i)
    })
}